<a href="https://colab.research.google.com/github/1fastgranada/CSC302_HW1/blob/main/HW1_ARoss.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Create a GitHub if you don’t have and provide your user name as a text submission.
  * GitHub user is ***1FastGranada***
  
    https://github.com/1fastgranada/
2. Use pandas to read the olympic_medals.csv from the DATA folder on Google Drive. Then perform the followings by
using pandas and/or Python built-in functions.

  (a) Find the size of the data frame. How many rows, how many columns?
  * *Based on the output from .info(), there are 2394 rows and 8 columns in this dataset.*

  (b) Use the appropriate function to report the data types for all columns.
  * *Based on the output from .info(), we can see all columns are object data types with the exception of "year", which is int64*

  (c) Find how many unique cities matches were held at. (Hint: unique( ). For instance, the following example tells
how many unique Events held:)
len(medals['Event'].unique())
  * *There are 23 unique cities where matches were held at.*

  (d) Find how many medals the USA team won in total.
  * *The USA team won 638 medals.*

  (e) Find the total number of medals for each Nationality. (Hint: please search for groupby() function with count.
For instance, the following example counts at how many locations each event was held. )
medals.groupby(by='Event')['Location'].count()
  * *Please see the output below for total number of medals for each Nationality*

In [6]:
import pandas as pd

medals = pd.read_csv("/content/drive/MyDrive/DATA/olympic_medals.csv")
medals.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2394 entries, 0 to 2393
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Gender       2394 non-null   object
 1   Event        2394 non-null   object
 2   Location     2394 non-null   object
 3   Year         2394 non-null   int64
 4   Medal        2394 non-null   object
 5   Name         2164 non-null   object
 6   Nationality  2394 non-null   object
 7   Result       2351 non-null   object
dtypes: int64(1), object(7)
memory usage: 149.8+ KB

Based on the output from .info():
* There are 2394 rows and 8 columns in this dataset.
* We can see all columns are object data types with the exception of "year", which is int64

In [7]:
len(medals['Location'].unique())

23

There are 23 unique cities where matches were held at.

In [17]:
len(medals.loc[medals['Nationality'] == 'USA'])

638

The USA team won 638 medals.

In [18]:
medals.groupby(by='Nationality')['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64